"""
Лабораторная работа №2
"""
# s="balalaika"
# s1=s[:5]+"###"+s[5:]
# print(s1)
# ---------------------------------
# s="Garnet"
# s1=s.find("e")
# print(s1)
# -------------------------------------
# s="Hellow world! I am Atomic"
# s1=s[0:8]+s[8+5:]
# print(s1)
#----------------------------------------
# s="ratatatatatatata"
# s1=s.replace("t","?")
# print(s1)
#----------------------------------------------
# s="paralelepiped"
# s1=s[:8]+s[8:8+2].upper()+s[8+2:]
# print(s1)
#---------------------------------------------
"""
Самостоятельная работа №3
"""
# s="Hello wrold! I Enter the number"
# s1=s.rindex("e")
# print(s1)
#----------------------------------------------------
# s="why are u do this?"
# name="Abdusattar"
# s1=s[:3]+name+s[3:]
# print(s1)
#--------------------------------------------------------
# s="Holla amigo! My name is Radrigo!"
# s1=s.replace(" ","_")
# print(s1)
#---------------------------------------------------
# s="balalayka"
# s1=s.count("a")
# print(s1)
#--------------------------------------------------
# s="Hello world!"
# s1=s[::-1]
# print(s1)